In [1]:
import pandas as pd
import numpy as np
# df = pd.read_csv("escolas_all.csv")
df = pd.read_csv("escolas.csv")
df.head()

,Escolas_Postos,BAIRRO,ENDEREÇO,lat,long,id
0,CENTRO INTEGRADO DE EDUCAÇÃO PÚBLICA HENFIL,CAJU,Rua Carlos Seidl S/Nº,"-22,880888","-43,225326",65
1,EM ALICE DO AMARAL PEIXOTO,BENFICA,Rua Ébano 187,"-22,889574","-43,236202",393
2,EM CELESTINO SILVA,CENTRO,"R. do Lavradio, 56","-22,909293","-43,183579",657
3,ESCOLA MUNICIPAL FLORIANO PEIXOTO,SÃO CRISTÓVÃO,Praça Argentina 20,"-22,897629","-43,227456",562
4,EM PEREIRA PASSOS,RIO COMPRIDO,Praça Condessa Paulo de Frontin 45,"-22,924412","-43,208579",130

In [40]:
df['tipo_escola'] = df.Escolas_Postos.apply(lambda x: x.startswith("EM"))
df.head()

,Escolas_Postos,BAIRRO,ENDEREÇO,lat,long,tipo_escola
0,EM GUATEMALA,BAIRRO DE FÁTIMA,Praça Presidente Aguirre Cerda 55,-22.918178,-43.188367,True
1,CIEP HENFIL,CAJU,Rua Carlos Seidl S/Nº,-22.880888,-43.225326,False
2,EM ALICE DO AMARAL PEIXOTO,BENFICA,Rua Ébano 187,-22.889574,-43.236202,True
3,EM BENJAMIN CONSTANT,SANTO CRISTO,"R. Monte Alegre, 255",-22.899970,-43.205479,True
4,EM CELESTINO SILVA,CENTRO,"R. do Lavradio, 56",-22.909293,-43.183579,True

In [41]:
df[df.tipo_escola == True].shape

(182, 6)

In [42]:
df[df.tipo_escola != True].shape

(54, 6)

In [43]:
df.drop(df[df.tipo_escola == True].sample(100).index, inplace=True)

In [44]:
df[['lat', 'long']] = df[['lat', 'long']].astype("str").replace("\.", ",", regex=True)
df.head()

,Escolas_Postos,BAIRRO,ENDEREÇO,lat,long,tipo_escola
1,CIEP HENFIL,CAJU,Rua Carlos Seidl S/Nº,"-22,880888","-43,225326",False
2,EM ALICE DO AMARAL PEIXOTO,BENFICA,Rua Ébano 187,"-22,889574","-43,236202",True
4,EM CELESTINO SILVA,CENTRO,"R. do Lavradio, 56","-22,909293","-43,183579",True
5,ESCOLA MUNICIPAL FLORIANO PEIXOTO,SÃO CRISTÓVÃO,Praça Argentina 20,"-22,897629","-43,227456",False
7,EM PEREIRA PASSOS,RIO COMPRIDO,Praça Condessa Paulo de Frontin 45,"-22,924412","-43,208579",True

In [10]:
# cria ids falsos
# np.random.sample(np.arange(1, 999), df.shape[0])
ids = np.random.choice(np.arange(10, 700), size=df.shape[0], replace=False)
ids

array([178, 634, 483, 476, 132, 410,  55, 490, 600,  89, 387, 331, 450,
       558, 413, 698, 540, 309, 268, 523,  17,  35,  11, 226, 638, 271,
       126, 180, 163, 361, 280,  60, 587, 653, 660, 382, 217, 378, 429,
        25, 367, 373, 624, 157,  20, 117, 502, 351, 135, 647, 440, 259,
       422,  41, 537, 230, 683, 146, 566, 388, 498, 663, 121, 161, 263,
       118, 140, 260, 236,  90, 274, 676, 390, 608, 589, 256,  91, 285,
       248, 441, 623, 603, 673, 182, 520, 412,  31, 514,  23, 415,  16,
       570, 528, 414, 690, 202, 550, 211, 526, 492, 466, 636, 527, 586,
        80, 398, 175, 308, 512, 576, 495, 379, 641, 689, 171, 477, 206,
       687, 568, 399, 255, 262, 633, 616, 320, 144, 534, 342,  52, 139,
       323, 573, 560, 246,  69, 319, 584, 311, 316, 497, 297,  68, 330,
       515, 289, 210, 474, 301, 215, 606, 590])

In [12]:
print(df.shape, ids.shape)

(151, 6) (151,)

In [13]:
df['id'] = ids
df.head()

,Escolas_Postos,BAIRRO,ENDEREÇO,lat,long,id
0,CENTRO INTEGRADO DE EDUCAÇÃO PÚBLICA HENFIL,CAJU,Rua Carlos Seidl S/Nº,"-22,880888","-43,225326",178
1,EM ALICE DO AMARAL PEIXOTO,BENFICA,Rua Ébano 187,"-22,889574","-43,236202",634
2,EM CELESTINO SILVA,CENTRO,"R. do Lavradio, 56","-22,909293","-43,183579",483
3,ESCOLA MUNICIPAL FLORIANO PEIXOTO,SÃO CRISTÓVÃO,Praça Argentina 20,"-22,897629","-43,227456",476
4,EM PEREIRA PASSOS,RIO COMPRIDO,Praça Condessa Paulo de Frontin 45,"-22,924412","-43,208579",132

In [14]:
material_didatico = df[['id']].copy()
qnt = np.random.randint(low=20, high=600, size=df.shape[0])
material_didatico['Quantidade'] = qnt
material_didatico['id'] = material_didatico['id'].apply(lambda x: str(x).zfill(3))

material_didatico.head()

    id  Quantidade
0  178          20
1  634         121
2  483         220
3  476         190
4  132          67

In [16]:

# df.drop(['tipo_escola', 'Quantidade'], axis=1).to_csv("escolas.csv", index=False)
df.to_csv("escolas.csv", index=False)
material_didatico[['id', 'Quantidade']].to_csv("material_didatico.csv", index=False)

In [1]:
# criar dado duplicado

In [35]:
import pandas as pd
df2 = pd.read_csv("escolas.csv")
df2.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
147    False
148    False
149    False
150    False
151     True
Length: 152, dtype: bool

In [36]:
df2.columns

Index(['id', 'Escolas_Postos', 'BAIRRO', 'ENDEREÇO ', 'lat', 'lon'], dtype='object')

In [23]:
df2.duplicated().sum()

13

In [24]:
df2.duplicated(subset='id').sum()

15

In [20]:
df2[df2.id.isin(df2[df2.duplicated(subset='id')].id.values)].sort_values('id')

Empty DataFrame
Columns: [Escolas_Postos, BAIRRO, ENDEREÇO , lat, long, id]
Index: []

In [17]:
df2[df2.duplicated(subset='id')].id.values

array([272, 120, 479, 377, 248, 479, 400, 861, 160, 292, 479, 188, 188,
       221, 259,  76, 377, 292, 720,  74, 292, 292])

In [14]:
df2.id.isin(df2.duplicated(subset='id').values)

0      False
1      False
2      False
3      False
4      False
       ...
146    False
147    False
148    False
149    False
150    False
Name: id, Length: 151, dtype: bool

In [30]:
df3 = pd.read_csv("material_didatico.csv")
df3.duplicated(subset='id').sum()

0

In [31]:
df3.head()

    id Quantidade
0  178         20
1  634        121
2  483        220
3  476        190
4  132         67

In [32]:
df3.isna().sum()

id            0
Quantidade    4
dtype: int64

In [33]:
df3.dtypes

id             int64
Quantidade    object
dtype: object

In [34]:
df3.Quantidade.astype(float)

ValueError: could not convert string to float: "''"